app/views/tunas/_form.html.erb

    <%= form.label :fish_id %>
    <%= form.collection_select :fish_id, Fish.all, :id, :name, {} %>
---
SELECT "fish".* FROM "fish"