app/views/sharks/_form.html.erb

SELECT "fish".* FROM "fish"
---
    <%= form.label :fish_id %>
    <%= form.collection_select :fish_id, Fish.all, :id, :name, {} %>