app/controllers/fish_controller.rb

  def index
    @fish = Fish.all
---
SELECT "fish".* FROM "fish"

  def create
    @fish = Fish.new(fish_params)

    respond_to do |format|
      if @fish.save
---
INSERT INTO "fish" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Mrs. Cale Parisian"], ["created_at", "2018-04-19 01:03:00.946758"], ["updated_at", "2018-04-19 01:03:00.946758"]]

  def update
    respond_to do |format|
      if @fish.update(fish_params)
---
UPDATE "fish" SET "name" = ?, "updated_at" = ? WHERE "fish"."id" = ?  [["name", "Changed"], ["updated_at", "2018-04-19 01:03:00.974367"], ["id", 1]]

  def destroy
    @fish.destroy
---
DELETE FROM "fish" WHERE "fish"."id" = ?  [["id", 1]]

    def set_fish
      @fish = Fish.find(params[:id])
---
SELECT  "fish".* FROM "fish" WHERE "fish"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]