app/controllers/sharks_controller.rb

SELECT "sharks".* FROM "sharks"
---
  def index
    @sharks = Shark.all

INSERT INTO "sharks" ("color", "fish_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["color", "ColorTest"], ["fish_id", 1], ["created_at", "2018-04-18 21:27:40.396915"], ["updated_at", "2018-04-18 21:27:40.396915"]]
---
  def create
    @shark = Shark.new(shark_params)

    respond_to do |format|
      if @shark.save

UPDATE "sharks" SET "color" = ?, "updated_at" = ? WHERE "sharks"."id" = ?  [["color", "Changed"], ["updated_at", "2018-04-18 21:39:04.934677"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @shark.update(shark_params)

DELETE FROM "sharks" WHERE "sharks"."id" = ?  [["id", 1]]
---
  def destroy
    @shark.destroy

SELECT  "sharks".* FROM "sharks" WHERE "sharks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_shark
      @shark = Shark.find(params[:id])