app/controllers/tunas_controller.rb

SELECT "tunas".* FROM "tunas"
---
  def index
    @tunas = Tuna.all

INSERT INTO "tunas" ("origin", "fish_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["origin", "OriginTest"], ["fish_id", 1], ["created_at", "2018-04-18 21:26:15.609612"], ["updated_at", "2018-04-18 21:26:15.609612"]]
---
  def create
    @tuna = Tuna.new(tuna_params)

    respond_to do |format|
      if @tuna.save

UPDATE "tunas" SET "origin" = ?, "updated_at" = ? WHERE "tunas"."id" = ?  [["origin", "Changed"], ["updated_at", "2018-04-18 21:40:39.193354"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @tuna.update(tuna_params)

DELETE FROM "tunas" WHERE "tunas"."id" = ?  [["id", 1]]
---
  def destroy
    @tuna.destroy

SELECT  "tunas".* FROM "tunas" WHERE "tunas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tuna
      @tuna = Tuna.find(params[:id])